[
  {"order": 0, "name": "Warden", "description": "Protects a player (not himself) at the beginning of the round from exchange and inspection", "friendly": true},
  {"order": 2, "name": "Werewolf", "description": "Wakes once with all werewolves, who will now be able to recognise each other. If alone, can look at a card in the middle", "friendly": false},
  {"order": 2, "name": "Alpha wolf", "description": "Wakes once with all werewolves, who will now be able to recognise each other. If alone, can look at a card in the middle. Wakes again after the other werewolves and switches an extra werewolf card with the role card of another player who is not a werewolf already unless protected by the warden", "friendly": false},
  {"order": 2, "name": "Seeing wolf", "description": "Wakes once with all werewolves, who will now be able to recognise each other. If alone, can look at a card in the middle. Wakes again after the other werewolves and can look at the role of another player unless protected by the warden", "friendly": false},
  {"order": 5, "name": "Ghost buster", "description": "Can look at two cards one after the other unless protected by the warden. If he chooses a werewolf, he becomes that role", "friendly": true},
  {"order": 5, "name": "Young seer", "description": "Can look at one card in the middle", "friendly": true},
  {"order": 6, "name": "Witch", "description": "Can look at a card in the middle. If she does so, she has to then switch that card with players card (even her own) unless protected by the warden. That player will not wake again for his/her new role", "friendly": true},
  {"order": 7, "name": "Idiot", "description": "Switches all role cards but his own and the middle cards one spot to the left or right unless protected by the warden", "friendly": true},
  {"order": 7, "name": "Fortune teller", "description": "Gets to know all players who have performed an action that night", "friendly": true},
  {"order": 10, "name": "Scout", "description": "Can turn a single card for all players to see unless protected by the warden", "friendly": true},
  {"order": 11, "name": "Curator", "description": "Not implemented, don't use", "friendly": true},
  {"order": "-", "name": "Prince", "description": "Cannot die. If he gets voted out, the player with the second most votes dies", "friendly": true},
  {"order": "-", "name": "Bodyguard", "description": "The player, who gets voted by the bodyguard, cannot die. The player with the second most votes wins if he/she has at least 2 votes. Only use the bodyguard when playing with 5 or more players", "friendly": true},
  {"order": "-", "name": "Villager", "description": "No special power. This role is easy to take as cover for werewolves, so be careful not to incriminate yourself", "friendly": true},
  {"order": "-", "name": "Sleeping werewolf", "description": "No special power. Will be visible as a werewolf to other werewolves, but does not wake at night", "friendly": false}
]
